# Задание №1
# Пользователь вводит целое число. Выведите его строку-описание вида "отрицательное четное число", 
# "нулевое число", "положительное нечетное число", например, численным описанием числа 190 является строка 
# "положительное четное число". Если число не является четным - выведите сообщение "число не является четным"

a = int(input())


if a == 0:
   print("нулевое число")
else:  
   print("число не является нулевым") 



# получилось только с 0
   